DataProcessors/РабочийСтолПродавца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>РабочийСтолПродавца</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТоварныйАссортиментТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТоварныйАссортиментТочек</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выведена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запрещена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>id_TT</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзПотерянных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТоварыКДобавлениюВАссортимент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТоварыКДобавлениюВАссортимент</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выигрыш</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВыкладки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаВыкладки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВывода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакАссортимента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупателей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КатегорииАссортимента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>КатегорииАссортимента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обязательный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новинки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсобыеТовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Необязательный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/РабочийСтолПродавца/Forms/ФормаДобавленияВАссортимент/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//+++АК SHEP 2018.11.12 ИП-00019893
	УстановитьПривилегированныйРежим(Истина);
	ТекНомерТочки = ПараметрыСеанса.НомерТочкиПоАйпи;
	ТекТорговаяТочка = ПараметрыСеанса.ТорговаяТочкаПоАйпи;
	//---АК SHEP 2018.11.12
	
КонецПроцедуры

//+++АК SHEP 2018.11.12 ИП-00019893
Процедура ЗаполнитьВыигрышИПокупателейДругиеВВ()
	ЗаполнитьВыигрыш();
	ЗаполнитьПокупателейДругиеВВ();
КонецПроцедуры

//+++АК SHEP 2018.09.19 ИП-00019893
&НаСервере
Процедура ЗаполнитьВыигрыш()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТЗнТоварыКДобавлениюВАсс = РеквизитФормыВЗначение("ТоварыКДобавлениюВАсс");
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос(
       "ВЫБРАТЬ
       |	втНоменклатураДляДобавления.Номенклатура,
       |	втНоменклатураДляДобавления.Цена,
       |	втНоменклатураДляДобавления.КоличествоВКоробке КАК КоличествоВУпаковке,
       |	втНоменклатураДляДобавления.СрокГодности
       |ПОМЕСТИТЬ ВтПотерянные
       |ИЗ
       |	&ТаблицаДанных КАК втНоменклатураДляДобавления
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ
       |	втНоменклатураДляДобавления.Номенклатура,
       |	ВЫРАЗИТЬ(втНоменклатураДляДобавления.Номенклатура КАК Справочник.Номенклатура).id_tov КАК id_tov,
       |	втНоменклатураДляДобавления.Цена,
       |	втНоменклатураДляДобавления.КоличествоВУпаковке,
       |	втНоменклатураДляДобавления.СрокГодности
       |ПОМЕСТИТЬ ВтПотерянныеПредварительно
       |ИЗ
       |	ВтПотерянные КАК втНоменклатураДляДобавления
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |УНИЧТОЖИТЬ ВтПотерянные
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ
       |	ВтПотерянныеПредварительно.id_tov,
       |	ВтПотерянныеПредварительно.СрокГодности КАК srok
       |ИЗ
       |	ВтПотерянныеПредварительно КАК ВтПотерянныеПредварительно
       |ГДЕ
       |	ВтПотерянныеПредварительно.СрокГодности <= 366");
	Запрос.УстановитьПараметр("ТаблицаДанных", ТЗнТоварыКДобавлениюВАсс);
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		МВТ.Закрыть();
		Возврат;
	КонецЕсли;
	
	ТЗнДанныеДляПотерянныхПродаж = РезультатЗапроса.Выгрузить();
	
	ADOСоединение = ВнешниеДанные.ПолучитьADOСоединение("srv-sql03");
	
	ТекстЗапросаSQL = "
		|SET NOCOUNT ON
		|
		|IF OBJECT_ID('tempdb..#TovTable') IS NOT NULL DROP Table #TovTable
		|CREATE TABLE #TovTable (
		|		id_tov integer,
		|		srok integer
		|	)
		|
		|INSERT INTO #TovTable VALUES";
	
	Для Каждого СтрокаТЗн Из ТЗнДанныеДляПотерянныхПродаж Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЗн.id_tov) Тогда Продолжить; КонецЕсли;
		ТекстЗапросаSQL = ТекстЗапросаSQL + "
		|	(" + ВнешниеДанные.ФорматПоля(СтрокаТЗн.id_tov) + "," + ВнешниеДанные.ФорматПоля(СтрокаТЗн.srok) + "),";
	КонецЦикла;
	
	ТекстЗапросаSQL = Лев(ТекстЗапросаSQL, СтрДлина(ТекстЗапросаSQL) - 1); // убираем последнюю запятую
	
	ТекДатаSQL = "'" + Формат(ТекущаяДата(), "ДФ=yyyyMMdd") + "'";
	ТекстЗапросаSQL = ТекстЗапросаSQL + "
	|SELECT
	|	tov.id_tov,
	|	ISNULL(SUM(ls.lost1), 0) AS lost
	|FROM #TovTable tov
	|
	|INNER JOIN [srv-sql03].vv03.dbo.lost_sales ls (NOLOCK)
	|	ON tov.id_tov = ls.id_tov_ls
	|	AND ls.date_ls >= DATEADD(DAY, -CAST((tov.srok + 1) / 2 AS int) - 1, "+ ТекДатаSQL + ")
	|	AND ls.date_ls <= " + ТекДатаSQL + "
	|
	|WHERE
	|	ls.shopNo_ls = " + ВнешниеДанные.ФорматПоля(ТекНомерТочки) + "
	|
	|GROUP BY
	|	tov.id_tov
	|";
	rs = ADOСоединение.Execute(ТекстЗапросаSQL);
	
	ТЗнДанныеДляПотерянныхПродаж = ВнешниеДанные.ПреобразоватьРезультатВТаблицуЗначений(rs);
	ADOСоединение.Close();
	
	Если ТЗнДанныеДляПотерянныхПродаж.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	Запрос.УстановитьПараметр("ТЗнДанныеДляПотерянныхПродаж", ТЗнДанныеДляПотерянныхПродаж);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЗнДанныеДляПотерянныхПродаж.id_tov,
		|	ТЗнДанныеДляПотерянныхПродаж.lost
		|ПОМЕСТИТЬ ВтПотерянныеЗаПериод
		|ИЗ
		|	&ТЗнДанныеДляПотерянныхПродаж КАК ТЗнДанныеДляПотерянныхПродаж
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтПотерянныеПредварительно.Номенклатура,
		|	ВтПотерянныеПредварительно.Номенклатура.КатегорияАссортимента КАК КатегорияАссортимента,
		|	ВтПотерянныеПредварительно.КоличествоВУпаковке,
		|	ВтПотерянныеПредварительно.Цена,
		|	ЕСТЬNULL(ВтПотерянныеЗаПериод.lost, 0) КАК КоличествоПотерянных,
		|	ВтПотерянныеПредварительно.СрокГодности КАК СрокГодностиВДнях
		|ПОМЕСТИТЬ втКДобавлениюТовары
		|ИЗ
		|	ВтПотерянныеПредварительно КАК ВтПотерянныеПредварительно
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПотерянныеЗаПериод КАК ВтПотерянныеЗаПериод
		|		ПО ВтПотерянныеПредварительно.id_tov = ВтПотерянныеЗаПериод.id_tov
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВтПотерянныеЗаПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВтПотерянныеПредварительно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКДобавлениюТовары.Номенклатура,
		|	ВЫБОР
		|		КОГДА втКДобавлениюТовары.СрокГодностиВДнях = 0
		|			ТОГДА 0
		|		ИНАЧЕ втКДобавлениюТовары.Цена * ВЫБОР
		|				КОГДА втКДобавлениюТовары.КоличествоПотерянных > втКДобавлениюТовары.КоличествоВУпаковке
		|						И НЕ втКДобавлениюТовары.КатегорияАссортимента = ЗНАЧЕНИЕ(Перечисление.КатегорииАссортимента.ОсобыеТовары)
		|					ТОГДА втКДобавлениюТовары.КоличествоПотерянных
		|				ИНАЧЕ 0
		|			КОНЕЦ / втКДобавлениюТовары.СрокГодностиВДнях
		|	КОНЕЦ КАК Выигрыш
		|ИЗ
		|	втКДобавлениюТовары КАК втКДобавлениюТовары";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			СтрокаТаб = ТЗнТоварыКДобавлениюВАсс.Найти(ВыборкаЗапроса.Номенклатура, "Номенклатура");
			Если СтрокаТаб <> Неопределено Тогда
				СтрокаТаб.Выигрыш = ВыборкаЗапроса.Выигрыш;
			КонецЕсли;
		КонецЦикла;
		ТЗнТоварыКДобавлениюВАсс.Сортировать("Выигрыш УБЫВ");
		ЗначениеВРеквизитФормы(ТЗнТоварыКДобавлениюВАсс, "ТоварыКДобавлениюВАсс");
	КонецЕсли;
	
КонецПроцедуры

//+++АК SHEP 2018.11.12 ИП-00019893
&НаСервере
Процедура ЗаполнитьПокупателейДругиеВВ()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ADOСоединение = ВнешниеДанные.ПолучитьADOСоединение("srv-sql01");
	
	ТекстЗапросаSQL = "
		|SET NOCOUNT ON
		|
		|SELECT
		|	bovv.id_tov,
		|	bovv.id_kontr,
		|	ISNULL(bovv.cnt, 0) AS cnt
		|FROM reports.dbo.Buyer_Others_VV bovv (NOLOCK)
		|
		|WHERE
		|	bovv.shopNo = " + ВнешниеДанные.ФорматПоля(ТекНомерТочки) + "
		|	AND bovv.id_kontr is NOT NULL
		|	AND ISNULL(bovv.cnt, 0) > 0
		|";
	rs = ADOСоединение.Execute(ТекстЗапросаSQL);
	
	ТЗнПокупателейДругиеВВ = ВнешниеДанные.ПреобразоватьРезультатВТаблицуЗначений(rs);
	ADOСоединение.Close();
	
	Если ТЗнПокупателейДругиеВВ.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТЗнПокупателейДругиеВВ.id_tov,
		|	ТЗнПокупателейДругиеВВ.id_kontr КАК id_kontr,
		|	ТЗнПокупателейДругиеВВ.cnt КАК ПокупателейДругиеВВ
		|ПОМЕСТИТЬ ВтПокупателейДругиеВВ
		|ИЗ
		|	&ТЗнПокупателейДругиеВВ КАК ТЗнПокупателейДругиеВВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКДобавлениюВАсс.Номенклатура,
		|	ТоварыКДобавлениюВАсс.Характеристика
		|ПОМЕСТИТЬ ВтТоварыКДобавлениюВАсс
		|ИЗ
		|	&ТоварыКДобавлениюВАсс КАК ТоварыКДобавлениюВАсс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТоварыКДобавлениюВАсс.Номенклатура,
		|	ВтТоварыКДобавлениюВАсс.Характеристика,
		|	ЕСТЬNULL(ВтПокупателейДругиеВВ.ПокупателейДругиеВВ, 0) КАК ПокупателейДругиеВВ
		|ИЗ
		|	ВтТоварыКДобавлениюВАсс КАК ВтТоварыКДобавлениюВАсс
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтПокупателейДругиеВВ КАК ВтПокупателейДругиеВВ
		|			ПО СпрНоменклатура.id_tov = ВтПокупателейДругиеВВ.id_tov
		|		ПО ВтТоварыКДобавлениюВАсс.Номенклатура = СпрНоменклатура.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО ВтТоварыКДобавлениюВАсс.Характеристика = ХарактеристикиНоменклатуры.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО (ХарактеристикиНоменклатуры.Ссылка = ЗначенияСвойствОбъектов.Объект)
		|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО (ЗначенияСвойствОбъектов.Значение = Контрагенты.Ссылка)
		|			И (ВтПокупателейДругиеВВ.id_kontr = Контрагенты.ИД)");
	Запрос.УстановитьПараметр("ТЗнПокупателейДругиеВВ", ТЗнПокупателейДругиеВВ);
	Запрос.УстановитьПараметр("ТоварыКДобавлениюВАсс", ТоварыКДобавлениюВАсс.Выгрузить(, "Номенклатура,Характеристика"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		СтруктураОтбора = Новый Структура("Номенклатура,Характеристика");
		
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, ВыборкаЗапроса);
			МассивСтрок = ТоварыКДобавлениюВАсс.НайтиСтроки(СтруктураОтбора);
			Для Каждого СтрокаТаб Из МассивСтрок Цикл
				СтрокаТаб.ПокупателейДругиеВВ = ВыборкаЗапроса.ПокупателейДругиеВВ;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВАссортимент(Команда)
	Фл=Истина;
	ДобавитьВАссортиментСервер(Фл);
	Если Фл=Ложь Тогда
		Возврат;
	КонецЕсли; 
	//ВладелецФормы.ОбновитьДанныеПоАссортименту();
	//ТоварыКДобавлениюВАсс.Очистить();
	МасНом=Новый Массив;
	МасХар=Новый Массив;
	Для каждого Стр Из ТоварыКДобавлениюВАсс Цикл
		Если Стр.Пометка=Ложь Тогда
			Продолжить;
		КонецЕсли;
		Если МасНом.Найти(Стр.Номенклатура)=Неопределено Тогда
			МасНом.Добавить(Стр.Номенклатура);
		КонецЕсли; 
		МасХар.Добавить(Стр.Характеристика);
	КонецЦикла; 
	Кол=ТоварыКДобавлениюВАсс.Количество();
	Для Сч=0 По Кол-1 Цикл
		Если МасХар.Найти(ТоварыКДобавлениюВАсс[Кол-1-Сч].Характеристика)<>Неопределено Тогда
			ТоварыКДобавлениюВАсс.Удалить(Кол-1-Сч);	
		КонецЕсли; 
	КонецЦикла; 
	
	Кол=ВладелецФормы.ТоварыКДобавлениюВАсс.Количество();
	Для Сч=0 По Кол-1 Цикл
		Если МасХар.Найти(ВладелецФормы.ТоварыКДобавлениюВАсс[Кол-1-Сч].Характеристика)<>Неопределено Тогда
			ВладелецФормы.ТоварыКДобавлениюВАсс.Удалить(Кол-1-Сч);	
		КонецЕсли; 
	КонецЦикла; 
	
	//Для каждого Стр Из ВладелецФормы.ТоварыКДобавлениюВАсс Цикл
	//	НовСтр=ТоварыКДобавлениюВАсс.Добавить();
	//	ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	ВладелецФормы.ЗаполнитьТаблицуОграничений(МасНом);
	//КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ДобавитьВАссортиментСервер(Фл)
	УстановитьПривилегированныйРежим(Истина);
	//+++AK ziga ИП-00017475 20171218

	Если Не РольДоступнаСервер() Тогда
		ДЛя каждого Товар из ТоварыКДобавлениюВАсс Цикл
			Если Товар.Пометка=Ложь Тогда
				Продолжить;
			КонецЕсли;
			Если Товар.Номенклатура.КатегорияАссортимента=Перечисления.КатегорииАссортимента.ОсобыеТовары Тогда
				
				Сообщить("Товар из категории ассортимента ""Особые товары"" могут добавлять только сотрудники управления расчета товаров");
				Фл=Ложь;
				Возврат;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
//---AK ziga ИП-00017475 20171218

	Для каждого Стр Из ТоварыКДобавлениюВАсс Цикл
		Если Стр.Пометка=Ложь Тогда
			Продолжить;
		КонецЕсли; 
		Мен=РегистрыСведений.ТоварныйАссортиментТочек.СоздатьМенеджерЗаписи();
		Мен.Период=НачалоДня(ТекущаяДата());
		Мен.ДатаСозданияЗаписи=ТекущаяДата();
		Мен.Номенклатура=Стр.Номенклатура;
		//+++АК SHEP 2018.11.12 ИП-00019893
		//Мен.ТорговаяТочка=ПараметрыСеанса.ТорговаяТочкаПоАйпи;
		Мен.ТорговаяТочка = ТекТорговаяТочка;
		//---АК SHEP 2018.11.12
		Мен.ИзПотерянных=Истина;
		Мен.Характеристика 	= Стр.Характеристика;
		Мен.id_TT=Мен.ТорговаяТочка.id_TT;
		Попытка
			Мен.Записать();
		Исключение
			Фл=Ложь;
			Прервать;
		КонецПопытки; 
		//+++ziga ИП-00017181 14122017
		ДопМодульСервер.ДобавитьПланыПродажНаНеделюВперед(Мен.ТорговаяТочка, Мен.Номенклатура);
		//---ziga ИП-00017181 14122017
		Мен=РегистрыСведений.ТоварыКДобавлениюВАссортимент.СоздатьМенеджерЗаписи();
		Мен.Период=НачалоДня(ТекущаяДата());
		Мен.Номенклатура=Стр.Номенклатура;
		//+++АК SHEP 2018.11.12 ИП-00019893
		//Мен.ТорговаяТочка=ПараметрыСеанса.ТорговаяТочкаПоАйпи;
		Мен.ТорговаяТочка = ТекТорговаяТочка;
		//---АК SHEP 2018.11.12
		Мен.Удалить();

	КонецЦикла;
	
КонецПроцедуры
//+++AK ziga ИП-00017475 20171218
&НаСервере
Функция РольДоступнаСервер()
		//НаименованиеДопПрава="Возможность выбирать статус рабочая";
	Если Не  РольДоступна("ПолныеПрава") Тогда
		МассивПрава=УправлениеДопПравамиПользователей.ПрочитатьЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.МожетДобавлятьАссортиментДляОсобыхТоваров,Ложь,ПараметрыСеанса.ТекущийПользователь);	
		ПравоИзм=МассивПрава[0];
		Возврат ПравоИзм;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции
//---AK ziga ИП-00017475.01 20171218

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого Стр Из ВладелецФормы.ТоварыКДобавлениюВАсс Цикл
		НовСтр=ТоварыКДобавлениюВАсс.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	КонецЦикла;
	
	//+++АК SHEP 2018.09.19 ИП-00019893: заполняем выигрыш здесь
	Если ТоварыКДобавлениюВАсс.Количество() > 0 Тогда
		ЗаполнитьВыигрышИПокупателейДругиеВВ();
	КонецЕсли;
	//---АК SHEP 2018.09.19
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватУбыв(Команда)
	Если Элементы.ТоварыКДобавлениюВАсс.ТекущийЭлемент<>Неопределено Тогда
		Имя=СтрЗаменить(Элементы.ТоварыКДобавлениюВАсс.ТекущийЭлемент.Имя,"ТоварыКДобавлениюВАсс","");	
		ТоварыКДобавлениюВАсс.Сортировать(Имя+" Убыв");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СортироватВозр(Команда)
	Если Элементы.ТоварыКДобавлениюВАсс.ТекущийЭлемент<>Неопределено Тогда
		Имя=СтрЗаменить(Элементы.ТоварыКДобавлениюВАсс.ТекущийЭлемент.Имя,"ТоварыКДобавлениюВАсс","");	
		ТоварыКДобавлениюВАсс.Сортировать(Имя);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКДобавлениюВАссПриАктивизацииСтроки(Элемент)
	//Если Элементы.ТоварыКДобавлениюВАсс.ТекущиеДанные<>Неопределено Тогда
	//	Элементы.ТоварыКДобавлениюВАсс.ТолькоПросмотр=Элементы.ТоварыКДобавлениюВАсс.ТекущиеДанные.Выигрыш=0;
	//КонецЕсли; 
КонецПроцедуры
//---АК БЕЛН 20170220
